const charMap = {
  'А': 'a', 'Б': 'b', 'В': 'v', 'Г': 'g', 'Ґ': 'gg', 'Д': 'd', 'Е': 'e', 'Є': 'ye',
  'Ж': 'zh', 'З': 'z', 'И': 'y', 'І': 'i', 'Ї': 'yi', 'Й': 'j', 'К': 'k', 'Л': 'l',
  'М': 'm', 'Н': 'n', 'О': 'o', 'П': 'p', 'Р': 'r', 'С': 's', 'Т': 't', 'У': 'u',
  'Ф': 'f', 'Х': 'kh', 'Ц': 'ts', 'Ч': 'ch', 'Ш': 'sh', 'Щ': 'shch', 'Ь': 'soft',
  'Ю': 'yu', 'Я': 'ya'
};

const transliterate = (word) => {
  return word.split('').map(char => charMap[char] || char).join('').trim().toLowerCase();
};

const rawSyllables = [

  "БА", "ВА", "ГА", "ДА", "ЖА", "ЗА", "КА", "ЛА", "МА", "НА", "ПА", "РА", "СА", "ТА", "ХА", "ЦА", "ЧА", "ША", "ФА",

  "БО", "ВО", "ГО", "ДО", "ЖО", "ЗО", "КО", "ЛО", "МО", "НО", "ПО", "РО", "СО", "ТО", "ХО",

  "БУ", "ВУ", "ГУ", "ДУ", "ЖУ", "ЗУ", "КУ", "ЛУ", "МУ", "НУ", "ПУ", "РУ", "СУ", "ТУ", "ШУ",

  "БИ", "ВИ", "ГИ", "ДИ", "ЖИ", "ЗИ", "КИ", "ЛИ", "МИ", "НИ", "ПИ", "РИ", "СИ", "ТИ", "ШИ",

  "БЕ", "ВЕ", "ГЕ", "ДЕ", "ЗЕ", "КЕ", "ЛЕ", "МЕ", "НЕ", "РЕ", "СЕ", "ТЕ", "ЧЕ", "ШЕ", "ФЕ",

  "БІ", "ВІ", "ГІ", "ДІ", "ЗІ", "КІ", "ЛІ", "МІ", "НІ", "ПІ", "РІ", "СІ", "ТІ", "ХІ", "ЧІ",
];

export const syllablesData = rawSyllables.map(syl => ({
  syllable: syl,
  sound: `/assets/games/level_2/syllables/sounds/${transliterate(syl)}.mp3`
}));

export const getRandomSyllables = (count = 3) => {
  return [...syllablesData]
    .sort(() => Math.random() - 0.5)
    .slice(0, count);
};